/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putendl_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: a19060383 <a19060383@student.42lyon.fr>    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/22 17:36:34 by a19060383         #+#    #+#             */
/*   Updated: 2021/04/22 17:43:27 by a19060383        ###   ########lyon.fr   */
/*                                                                            */
/* ************************************************************************** */

// мин тест не удался, какое-то г пишется после

// перепроверить путь в include
// удалить мейн
// почему-то какой-то мусор пишется

#include "../for_school21/libft.h"

void ft_putendl_fd(char *s, int fd)
{
	int i;

	i = 0;
	if (fd != 1)
		write(1, "NULL", 5);
	else
		while (s[i] != '\0')
		{
			write(fd, &s[i], 1);
			i++;
		}
		if	(s[i] == '\0')
			write(fd, "\n", 2);
}

int main()
{
	ft_putendl_fd("hello\0", 1);
}
